{
    "title": "Proyectos",
    "summary": "Selección de proyectos en los que participé en el diseño, desarrollo e implementación de soluciones reales.",
    "disclaimer": {
        "title": "Disclaimer",
        "body": "La información presentada en este documento ha sido parcialmente anonimizada y ajustada con el objetivo de no divulgar información sensible de las empresas y clientes con los que he colaborado."
    },
    "labels": {
        "languages": "Lenguajes de programación",
        "stack": {
            "core": "Stack principal",
            "libraries": "Tecnologías y librerías"
        },
        "period": "Periodo del proyecto",
        "role": {
            "tab": "Rol",
            "items_description": "A continuación se listan las principales responsabilidades desempeñadas en el proyecto:"
        },
        "context": {
            "tab": "Contexto"
        },
        "challenges": {
            "tab": "Desafíos",
            "items_description": "En la siguiente lista se enumeran los principales retos durante el desarrollo del proyecto:"
        },
        "results": {
            "tab": "Resultados",
            "items_description": "Estos son los resultados alcanzados:"
        }
    },
    "items": [
        {
            "slug": "work-permissions-app",
            "title": "Sistema de gestión de permisos de trabajo",
            "description": "Digitalización y centralización del proceso de solicitud y validación de permisos de trabajo en un centro comercial.",
            "period": "OCT 2024 - MAR 2025",
            "role": {
                "main": "Desarrollador Frontend",
                "description": "Mi rol dentro del proyecto fue como desarrollador Full Stack; sin embargo, tuve un mayor enfoque en el desarrollo frontend y la implementación de la experiencia de usuario.",
                "responsabilities": [
                    "Diseño de la arquitectura general del sistema",
                    "Diseño de la base de datos en PostgreSQL",
                    "Escritura de queries y stored procedures",
                    "Diseño e implementación de interfaces UI/UX",
                    "Desarrollo frontend, incluyendo la integración con APIs",
                    "Apoyo en el desarrollo de endpoints del backend",
                    "Testing funcional y capacitación al personal operativo"
                ]
            },
            "language": [
                "TypeScript"
            ],
            "stack": {
                "core": [
                    "Next.js",
                    "React",
                    "Express.js",
                    "PostgreSQL",
                    "Azure"
                ],
                "libraries": [
                    "Mantine UI",
                    "Tailwind CSS",
                    "Tabler Icons",
                    "Zustand",
                    "Joi"
                ]
            },
            "context": [
                "El proyecto surgió a partir de la necesidad del cliente de digitalizar y centralizar el proceso de gestión de permisos de trabajo dentro de un centro comercial.",
                "El cliente administraba varios centros comerciales con múltiples locales, cada uno a cargo de un responsable. Cuando se requería realizar trabajos extraordinarios en un local, el responsable debía solicitar autorización a la administración mediante correo electrónico.",
                "Este proceso manual generaba falta de trazabilidad, retrasos en la aprobación de solicitudes y frecuentes errores operativos y de comunicación.",
                "El sistema debía permitir a los locatarios solicitar permisos de trabajo para sus locales y a los administradores validar, rechazar y dar seguimiento a dichas solicitudes mediante flujos controlados y definidos por rol.",
                "El proyecto incluyó levantamiento de requerimientos, definición de arquitectura y stack tecnológico, desarrollo, pruebas internas y en sitio con el cliente, documentación y capacitación a usuarios finales."
            ],
            "tecnical_challenges": {
                "description": "El principal desafío del proyecto se centró en comprender a fondo la operación, el lenguaje y las variantes del proceso del cliente, separando responsabilidades por rol y traduciéndolas en un sistema claro, legible y reactivo al perfil de cada usuario.",
                "items": [
                    "Definir claramente roles y permisos desde la base de datos hasta el frontend",
                    "Sincronizar la lógica de autorización de permisos entre backend y frontend",
                    "Garantizar que vistas, acciones y formularios se habilitaran dinámicamente según el rol del usuario",
                    "Almacenar de forma eficiente los permisos generados para su posterior análisis"
                ]
            },
            "results": {
                "description": "Como resultado, se desarrolló una plataforma y una API capaces de recibir, procesar y almacenar permisos de trabajo categorizados por centro comercial, local, responsable y tipo de permiso.",
                "items": [
                    "Centralizar la gestión de permisos de trabajo",
                    "Reducir significativamente los tiempos de respuesta administrativos",
                    "Mejorar la trazabilidad y el control del proceso",
                    "Eliminar la dependencia de procesos manuales y correos electrónicos"
                ]
            }
        }
    ]
}