{
    "title": "Proyectos",
    "summary": "Selección de proyectos en los que participé en el diseño, desarrollo e implementación de soluciones reales.",
    "disclaimer": {
        "title": "Disclaimer",
        "body": "La información presentada en este documento ha sido parcialmente anonimizada y ajustada con el objetivo de no divulgar información sensible de las empresas y clientes con los que he colaborado."
    },
    "labels": {
        "demo": "Ver demo",
        "languages": "Lenguajes de programación",
        "stack": {
            "core": "Stack principal",
            "libraries": "Tecnologías y librerías"
        },
        "period": "Periodo del proyecto",
        "role": {
            "tab": "Rol",
            "items_description": "A continuación se listan las principales responsabilidades desempeñadas en el proyecto:"
        },
        "context": {
            "tab": "Contexto"
        },
        "challenges": {
            "tab": "Desafíos",
            "items_description": "En la siguiente lista se enumeran los principales retos durante el desarrollo del proyecto:"
        },
        "results": {
            "tab": "Resultados",
            "items_description": "Estos son los resultados alcanzados:"
        },
        "images": {
            "tab": "Imágenes"
        }
    },
    "items": [
        {
            "slug": "work-permissions-app",
            "title": "Plataforma de gestión de permisos de trabajo para centros comerciales",
            "description": "Digitalización y centralización del proceso de solicitud y validación de permisos de trabajo en un centro comercial.",
            "period": "OCT 2024 - MAR 2025",
            "role": {
                "main": "Desarrollador Frontend",
                "description": "Participé como desarrollador Full Stack, con mayor enfoque en el desarrollo frontend y la implementación de la experiencia de usuario.",
                "responsabilities": [
                    "Diseño de la arquitectura general del sistema",
                    "Diseño de la base de datos en PostgreSQL",
                    "Desarrollo de queries y stored procedures",
                    "Diseño e implementación de interfaces UI/UX",
                    "Desarrollo frontend e integración con APIs",
                    "Apoyo en el desarrollo de endpoints del backend",
                    "Testing funcional y capacitación al personal operativo"
                ]
            },
            "language": [
                "TypeScript"
            ],
            "stack": {
                "core": [
                    "Next.js",
                    "React",
                    "Express.js",
                    "PostgreSQL",
                    "Azure"
                ],
                "libraries": [
                    "Mantine UI",
                    "Tailwind CSS",
                    "Tabler Icons",
                    "Zustand",
                    "Joi"
                ]
            },
            "context": [
                "El proyecto surgió a partir de la necesidad del cliente de digitalizar y centralizar la gestión de permisos de trabajo dentro de sus centros comerciales.",
                "Cada centro comercial contaba con múltiples locales, administrados por un responsable. Cuando se requería realizar trabajos extraordinarios —como ingreso de proveedores, adecuaciones o instalación de mobiliario— el responsable debía solicitar autorización a la administración mediante correo electrónico.",
                "Este proceso manual generaba: Falta de trazabilidad, retrasos en la aprobación de solicitudes, errores operativos y de comunicación",
                "El sistema debía permitir a los locatarios registrar solicitudes y a los administradores validarlas, rechazarlas o darles seguimiento mediante flujos definidos por rol.",
                "El proyecto incluyó levantamiento de requerimientos, definición de arquitectura y stack tecnológico, desarrollo, pruebas internas y en sitio, documentación y capacitación a usuarios finales."
            ],
            "tecnical_challenges": {
                "description": "El principal desafío del proyecto fue comprender a profundidad la operación del cliente, su lenguaje y las distintas variantes del proceso, separando responsabilidades por rol y traduciéndolas en un sistema claro, legible y dinámico según el perfil de cada usuario.",
                "items": [
                    "Definir claramente roles y permisos desde la base de datos hasta el frontend",
                    "Sincronizar la lógica de autorización de permisos entre backend y frontend",
                    "Garantizar que vistas, acciones y formularios se habilitaran dinámicamente según el rol del usuario",
                    "Diseñar una estructura de almacenamiento que permitiera análisis posteriores"
                ]
            },
            "results": {
                "description": "Como resultado, se desarrolló una plataforma y una API capaces de recibir, procesar y almacenar permisos de trabajo categorizados por centro comercial, local, responsable y tipo de permiso, permitiendo mayor control operativo y visibilidad administrativa.",
                "items": [
                    "Centralización del proceso de gestión de permisos",
                    "Reducción significativa en tiempos de respuesta administrativos",
                    "Mejora en la trazabilidad y control del proceso",
                    "Eliminación de la dependencia de procesos manuales y correos electrónicos"
                ]
            }
        },
        {
            "slug": "access-tickets-app",
            "title": "Sistema de gestión de accesos y pesaje para vehículos de carga",
            "description": "Sistema de gestión de accesos y pesaje industrial para vehículos de carga, con visión por computadora y operación local.",
            "period": "NOV 2023 - MAY 2024",
            "role": {
                "main": "Desarrollador Full Stack.",
                "description": "Participé en el desarrollo del proyecto como Full Stack Developer, involucrándome principalmente en la construcción del núcleo del sistema: una API de eventos que centralizaba la operación. Además, participé en el diseño de la base de datos, el desarrollo de la aplicación móvil y el sitio web administrativo.",
                "responsabilities": [
                    "Diseño de la arquitectura general del sistema",
                    "Diseño de la base de datos en MySQL",
                    "Creación de tablas, queries y stored procedures",
                    "Implementación de interfaces UI/UX para web y aplicación móvil",
                    "Integración con el sistema de visión por computadora",
                    "Testing funcional y capacitación al personal operativo"
                ]
            },
            "language": [
                "TypeScript",
                "Dart",
                "Python"
            ],
            "stack": {
                "core": [
                    "Flutter",
                    "React",
                    "Next.js",
                    "Django",
                    "MySQL"
                ],
                "libraries": [
                    "MUI",
                    "Tailwind CSS",
                    "MUI Icons",
                    "Django REST Framework",
                    "Material"
                ]
            },
            "context": [
                "El cliente operaba múltiples accesos para vehículos de carga que transportaban material a granel por toneladas. Para ingresar a la planta, los vehículos debían pasar por una caseta equipada con una báscula industrial capaz de pesar el vehículo completo.",
                "El proceso de registro y cálculo del material transportado se realizaba de forma manual por el personal de caseta, mediante la impresión de boletas que incluían el peso del vehículo. Cada unidad debía ser pesada en tres momentos clave: Al ingresar vacío a la planta, al salir cargado hacia la ruta de entrega y al finalizar la ruta.",
                "Con base en estas mediciones, el área comercial calculaba los pesos brutos y netos del material vendido.",
                "Adicionalmente, cada vehículo contaba con un identificador visual único en la caja de transporte. El cliente buscaba automatizar la lectura de estos identificadores mediante visión por computadora, reduciendo la intervención manual e integrando automáticamente la lectura del peso al sistema.",
                "Ante este escenario, se propuso un sistema integral que permitiera: Detectar eventos de entrada y salida de forma automática; Generar boletas desde una aplicación móvil utilizada en caseta y brindar al área administrativa acceso centralizado a boletas y reportes.",
                "El proyecto incluyó levantamiento de requerimientos, definición de arquitectura y stack tecnológico, desarrollo, pruebas internas y en sitio, documentación y capacitación."
            ],
            "tecnical_challenges": {
                "description": "El mayor reto del proyecto estuvo relacionado con la implementación de la tecnología de visión por computadora. El equipo enfrentó múltiples dificultades en la instalación de cámaras y en la comunicación con la báscula industrial, principalmente debido a restricciones en la red del cliente y al uso de sistemas desactualizados en el hardware de pesaje.",
                "items": [
                    "Comprender a fondo la operación y los cálculos utilizados en el proceso",
                    "Interconectar múltiples componentes del sistema (báscula, cámaras, API, aplicaciones)",
                    "Coordinar ajustes en la infraestructura y servidores del cliente",
                    "Garantizar un sistema robusto, estable y tolerante a fallos en entornos industriales"
                ]
            },
            "results": {
                "description": "Como resultado, se implementó un sistema capaz de registrar automáticamente los eventos ocurridos en caseta, identificando cada vehículo y capturando su peso. Estos eventos se visualizaban en la aplicación móvil para la generación de boletas y posteriormente en el sitio web para su consulta y análisis.",
                "items": [
                    "Reducir significativamente el tiempo de registro de vehículos en caseta",
                    "Mejorar la trazabilidad y control de las boletas generadas",
                    "Generar reportes administrativos con KPIs relevantes para la toma de decisiones"
                ]
            }
        },
        {
            "slug": "romberg-test-app",
            "title": "Sistema de evaluación asistida para pruebas de Romberg",
            "description": "Plataforma de evaluación asistida que digitaliza y estandariza la prueba de Romberg para operadores de transporte.",
            "period": "JUN 2023 - DIC 2023",
            "role": {
                "main": "Desarrollador Full Stack",
                "description": "Participé como desarrollador Full Stack, con mayor enfoque en el desarrollo de la aplicación de escritorio, el diseño del flujo guiado de evaluación y la integración en tiempo real con el modelo de visión por computadora.",
                "responsabilities": [
                    "Diseño de la arquitectura general de la solución",
                    "Desarrollo de la aplicación de escritorio en Electron con React",
                    "Diseño e implementación del flujo guiado de la evaluación",
                    "Manejo del estado global de la prueba",
                    "Generación de señales visuales, gráficas y alertas sonoras",
                    "Integración con el modelo de visión por computadora",
                    "Comunicación en tiempo real mediante WebSockets",
                    "Almacenamiento local de resultados y sincronización con servicios externos"
                ]
            },
            "language": [
                "TypeScript",
                "Bash"
            ],
            "stack": {
                "core": [
                    "Electron.js",
                    "React"
                ],
                "libraries": [
                    "WebSockets",
                    "JSON"
                ]
            },
            "context": [
                "Uno de los clientes de la empresa, dedicado al transporte de personal, identificó un área de oportunidad en su proceso de evaluación médica previa a la operación de unidades.",
                "Antes de iniciar un viaje, los operadores deben aprobar diversas pruebas médicas, siendo una de las más relevantes la prueba de Romberg, la cual evalúa la estabilidad y el equilibrio del usuario mediante la ejecución de distintas posturas y movimientos corporales.",
                "El proceso existente se realizaba de forma manual y era supervisado por personal de enfermería, lo que provocaba: Criterios de evaluación variables, falsos positivos, falta de trazabilidad y evidencia del proceso.",
                "Como solución, se propuso un sistema integral de evaluación asistida, capaz de: Guiar al operador durante cada etapa de la prueba, estandarizar los criterios de aprobación y generar evidencia digital del proceso.",
                "El sistema define reglas claras de evaluación: El operador debe aprobar 3 de 4 pruebas para considerarse apto; En caso de fallo, se ejecuta una segunda ronda con pruebas simplificadas, para aprobar esta ronda, debe superar las 4 pruebas; de lo contrario, se considera no apto para operar",
                "El proyecto incluyó levantamiento de requerimientos, definición de arquitectura y stack tecnológico, desarrollo, pruebas internas y en sitio, documentación y capacitación a usuarios finales."
            ],
            "tecnical_challenges": {
                "description": "El principal desafío del proyecto fue garantizar una comunicación estable y confiable entre la aplicación de escritorio y el modelo de visión por computadora, lo que requirió múltiples iteraciones hasta definir una solución robusta y tolerante a fallos.",
                "items": [
                    "Evaluación de distintos protocolos de comunicación entre componentes",
                    "Ejecución de flujos y scripts independientes por prueba e intento",
                    "Operación continua ante intermitencias de red y apagones inesperados",
                    "Almacenamiento local de resultados con reintentos automáticos de envío al restablecer la conexión"
                ]
            },
            "results": {
                "description": "El proyecto dio como resultado un sistema integral robusto, con tolerancia a fallos de red y energía, que permitió al cliente:",
                "items": [
                    "Digitalizar completamente la prueba de Romberg",
                    "Unificar y estandarizar los criterios de evaluación",
                    "Generar trazabilidad y evidencia digital de cada prueba",
                    "Reducir significativamente el error humano en la evaluación de operadores"
                ]
            }
        }
    ]
}