{
  "title": "Projects",
  "summary": "A selection of projects in which I participated in the design, development, and implementation of real-world solutions.",
  "disclaimer": {
    "title": "Disclaimer",
    "body": "The information presented in this document has been partially anonymized and adapted in order to avoid disclosing sensitive information related to the companies and clients I have worked with."
  },
  "labels": {
    "languages": "Programming languages",
    "stack": {
      "core": "Core stack",
      "libraries": "Technologies and libraries"
    },
    "period": "Project period",
    "role": {
      "tab": "Role",
      "items_description": "The following list outlines the main responsibilities carried out during the project:"
    },
    "context": {
      "tab": "Context"
    },
    "challenges": {
      "tab": "Challenges",
      "items_description": "The following list describes the main challenges encountered during the project development:"
    },
    "results": {
      "tab": "Results",
      "items_description": "These are the results achieved:"
    }
  },
  "items": [
    {
      "slug": "work-permissions-app",
      "title": "Work Permit Management System",
      "description": "Digitalization and centralization of the work permit request and validation process within a shopping mall.",
      "period": "OCT 2024 - MAR 2025",
      "role": {
        "main": "Frontend Developer",
        "description": "My role in the project was as a Full Stack Developer; however, I had a stronger focus on frontend development and user experience implementation.",
        "responsabilities": [
          "Design of the overall system architecture",
          "PostgreSQL database design",
          "Writing queries and stored procedures",
          "UI/UX design and implementation",
          "Frontend development, including API integration",
          "Support in backend endpoint development",
          "Functional testing and training for operational staff"
        ]
      },
      "language": [
        "TypeScript"
      ],
      "stack": {
        "core": [
          "Next.js",
          "React",
          "Express.js",
          "PostgreSQL",
          "Azure"
        ],
        "libraries": [
          "Mantine UI",
          "Tailwind CSS",
          "Tabler Icons",
          "Zustand",
          "Joi"
        ]
      },
      "context": [
        "The project originated from the client’s need to digitalize and centralize the work permit management process within a shopping mall.",
        "The client managed several shopping malls with multiple stores, each assigned to a responsible manager. Whenever extraordinary work was required in a store, the manager had to request authorization from the administration via email.",
        "This manual process caused a lack of traceability, approval delays, and frequent operational and communication errors.",
        "The system needed to allow tenants to request work permits for their stores and enable administrators to approve, reject, and track those requests through controlled, role-based workflows.",
        "The project included requirements gathering, architecture and technology stack definition, development, internal and on-site testing with the client, documentation, and training for end users."
      ],
      "tecnical_challenges": {
        "description": "The main challenge of the project was gaining a deep understanding of the client’s operation, terminology, and process variations, separating responsibilities by role and translating them into a clear, readable system that reacted dynamically to each user profile.",
        "items": [
          "Clearly defining roles and permissions from the database layer to the frontend",
          "Synchronizing permission authorization logic between backend and frontend",
          "Ensuring that views, actions, and forms were dynamically enabled based on user role",
          "Efficiently storing generated permits for later analysis"
        ]
      },
      "results": {
        "description": "As a result, a platform and API were developed to receive, process, and store work permits categorized by shopping mall, store, responsible party, and permit type.",
        "items": [
          "Centralized work permit management",
          "Significant reduction in administrative response times",
          "Improved process traceability and control",
          "Elimination of dependency on manual processes and email communication"
        ]
      }
    }
  ]
}